app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.all

SELECT "customers".* FROM "customers" ORDER BY created_at
---
def download_pdf
  @customers = Customer.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @customer = Customer.find(params[:id])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO "customers" ("address", "city", "courselocation", "created_at", "email", "instructorsname", "name", "phone", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "customers" SET "instructorsname" = 'Yuorij', "updated_at" = '2012-02-16 09:01:06.240527' WHERE "customers"."id" = 1
---
  def update
    @customer = Customer.find(params[:id])

    respond_to do |format|
      if @customer.update_attributes(params[:customer])